jfazekas21/ESP32S3-fishBowl/sdkconfig.defaults
# ESP32S3-specific configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ESP32S3-specific
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Component config
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
